#include <stdio.h>
void main()
{
	int i,n,m,o,p,q,k=0,a=1,b=1;/*其中o为百位数字，p为十位数字，q为个位数字，k的主要作用是帮助累加，调整输出格式*/
	/*a、b是专门为设计三角形输出设计的*/
	printf("===此程序的目的是输出n到m的含有5的数字===\n");
	printf("清输入\tn，m(其中n、m均为三位数):\n");/*n为较小的数字，m为较大的数字*/
	scanf("%d,%d",&n,&m);
	if((n>99&&m<1000))
		  {
	printf("结果：\n");
	i=n;
	for(;i<1000;i++)/*?????????????为什么其中的“i<1000”不能为“i<=m”呢？*/
	{
		o=i/100;
		p=i%100/10;
		q=i%10;
		if(o-5==0||p-5==0||q-5==0)
		{
			printf("%4d",i);
			k++;
			if(k==b)/*???????????这个if放在里面和放在外面有什么区别？*/
			{
				printf("\n");
				a++;
				b=b+a;/*a代表每行有多少个数字，b代表前面几项的和。*/
			}
		}
	}
	printf("\n");
		  }
	else
	{
		printf("您输入的格式不正确，请重新输入：\n");/*???????????????怎样重新让程序进入“入口”？*/
		scanf("%d,%d",&n,&m);
	}
}